DataProcessors/ПересчетЦенДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПересчетЦенДоговоров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПлановыеЦеныНаРесурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеЦеныНаРесурсы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПрошлогоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПрошлогоПериодаСоСтатьей103</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПрошлогоПериодаСоцПакет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПересчетЦенДоговоров/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПересчитатьЦены(Команда)
	ПересчитатьЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦеныНаСервере()
	
	Для Каждого Договор Из СписокДоговоров Цикл
		
		ДогОб = Договор.Значение.ПолучитьОбъект();
		
		Для Каждого Стр Из ДогОб.Материалы Цикл
			Стр.Цена = ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Материал, Неопределено, ДогОб.ДатаОкончания);
			Стр.Сумма = Стр.Цена * Стр.Количество;
		КонецЦикла;
		
		Для Каждого Стр Из ДогОб.Персонал Цикл
			КоличествоЧасов = ?(Стр.Цена=0,0,Стр.Сумма / Стр.Цена);
			Стр.Цена	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Должность, Стр.СтатьяЗатрат, ДогОб.ДатаОкончания);
			Стр.ЦенаПрошлогоПериода	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Должность, Стр.СтатьяЗатрат, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериода");
			Стр.ЦенаПрошлогоПериодаСоСтатьей103	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Должность, Стр.СтатьяЗатрат, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериодаСоСтатьей103");
			Стр.ЦенаПрошлогоПериодаСоцПакет	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Должность, Стр.СтатьяЗатрат, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериодаСоцПакет");
			Стр.Сумма = Стр.Цена * КоличествоЧасов;
			Стр.СуммаПрошлогоПериода = Стр.ЦенаПрошлогоПериода * КоличествоЧасов;
			Стр.СуммаПрошлогоПериодаСоСтатьей103 = Стр.ЦенаПрошлогоПериодаСоСтатьей103 * КоличествоЧасов;
			Стр.СуммаПрошлогоПериодаСоцПакет = Стр.ЦенаПрошлогоПериодаСоцПакет * КоличествоЧасов;
		КонецЦикла;
		
		Для Каждого Стр Из ДогОб.Инструменты Цикл
			Стр.Цена	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Инструмент,Неопределено, ДогОб.ДатаОкончания);
			Стр.ЦенаПрошлогоПериода	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Инструмент, Неопределено, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериода");
			Стр.ЦенаПрошлогоПериодаСоСтатьей103	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Инструмент, Неопределено, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериодаСоСтатьей103");
			Стр.ЦенаПрошлогоПериодаСоцПакет	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Инструмент, Неопределено, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериодаСоцПакет");
			Стр.Сумма = Стр.Цена * Стр.КоличествоЧасов;
			Стр.СуммаПрошлогоПериода = Стр.ЦенаПрошлогоПериода * Стр.КоличествоЧасов;
			Стр.СуммаПрошлогоПериодаСоСтатьей103 = Стр.ЦенаПрошлогоПериодаСоСтатьей103 * Стр.КоличествоЧасов;
			Стр.СуммаПрошлогоПериодаСоцПакет = Стр.ЦенаПрошлогоПериодаСоцПакет * Стр.КоличествоЧасов;
		КонецЦикла;
		
		ДогОб.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНаРесурс(Организация, Сценарий, Ресурс, СтатьяЗатрат, ДатаРасчета = Неопределено, ВидЦеныПерсонала = "Цена")  
	
	Если Не ЗначениеЗаполнено(ДатаРасчета) Тогда 
		ДатаРасчета = ТекущаяДата();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеЦеныНаРесурсыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ПлановыеЦеныНаРесурсы.СрезПоследних(
		|			&ДатаРасчета,
		|			Организация = &Организация
		|				И Ресурс = &Ресурс
		|				И Сценарий = &Сценарий
		|				И (СтатьяЗатрат = &СтатьяЗатрат
		|					ИЛИ &СтатьяЗатрат = НЕОПРЕДЕЛЕНО)) КАК ПлановыеЦеныНаРесурсыСрезПоследних";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,".Цена","."+ВидЦеныПерсонала);
	
	Запрос.УстановитьПараметр("ДатаРасчета",	ДатаРасчета);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.Персонал") Тогда 
		Запрос.УстановитьПараметр("Ресурс",		Ресурс.Должность);
	Иначе 
		Запрос.УстановитьПараметр("Ресурс",		Ресурс);
	КонецЕсли;
	Запрос.УстановитьПараметр("Сценарий",		Сценарий);
	Запрос.УстановитьПараметр("СтатьяЗатрат",	СтатьяЗатрат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Цена
	КонецЦикла;
	
	Возврат 0

КонецФункции
